## TF Plan for app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_amplify_app.learning_resources will be updated in-place
  ~ resource "aws_amplify_app" "learning_resources" {
      ~ environment_variables         = {
          + "SENTRY_DSN"                  = (sensitive)
            # (6 unchanged elements hidden)
        }
        id                            = "d1aa42w7dd40bx"
        name                          = "learning-app"
        tags                          = {}
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_amplify_app.learning_resources_nuxt3 will be created
  + resource "aws_amplify_app" "learning_resources_nuxt3" {
      + access_token                  = (sensitive value)
      + arn                           = (known after apply)
      + auto_branch_creation_patterns = [
          + "ci*",
          + "feature*/",
          + "fix*",
          + "release*",
        ]
      + build_spec                    = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - cd frontend 
                    - cp .contentful.json.sample .contentful.json
                    - nvm use $VERSION_NODE_16
                build:
                  commands:
                    - nvm use $VERSION_NODE_16
                    - node -v
                    - npm run generate
              artifacts:
                baseDirectory: frontend/.output/public
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      + default_domain                = (known after apply)
      + enable_auto_branch_creation   = true
      + enable_branch_auto_deletion   = true
      + environment_variables         = {
          + "ENV"                         = "staging"
          + "contentful_cda_access_token" = (sensitive)
        }
      + id                            = (known after apply)
      + name                          = "learning-app-nuxt3"
      + platform                      = "WEB"
      + production_branch             = (known after apply)
      + repository                    = "https://github.com/cds-snc/resources-ressources"
      + tags_all                      = (known after apply)

      + auto_branch_creation_config {
          + enable_auto_build             = true
          + enable_pull_request_preview   = true
          + pull_request_environment_name = "pr"
          + stage                         = "PULL_REQUEST"
        }

      + custom_rule {
          + source = "/<*>"
          + status = "404"
          + target = "/index.html"
        }
    }

  # aws_amplify_app.learning_resources_staging will be updated in-place
  ~ resource "aws_amplify_app" "learning_resources_staging" {
      ~ environment_variables         = {
          + "GOOGLE_ANALYTICS_ID"         = ""
          + "SENTRY_DSN"                  = (sensitive)
            # (5 unchanged elements hidden)
        }
        id                            = "d3eik05156ec7t"
        name                          = "Learning Resources (Staging)"
        tags                          = {}
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_amplify_branch.nuxt3 will be created
  + resource "aws_amplify_branch" "nuxt3" {
      + app_id                        = (known after apply)
      + arn                           = (known after apply)
      + associated_resources          = (known after apply)
      + branch_name                   = "nuxt3"
      + custom_domains                = (known after apply)
      + destination_branch            = (known after apply)
      + display_name                  = "beta"
      + enable_auto_build             = true
      + enable_pull_request_preview   = true
      + framework                     = "Nuxt3"
      + id                            = (known after apply)
      + pull_request_environment_name = "PULL_REQUEST"
      + source_branch                 = (known after apply)
      + stage                         = "BETA"
      + tags_all                      = (known after apply)
    }

  # aws_amplify_domain_association.learning_resources_nuxt3 will be created
  + resource "aws_amplify_domain_association" "learning_resources_nuxt3" {
      + app_id                              = (known after apply)
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "v3.learning-resources.cdssandbox.xyz"
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "nuxt3"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "nuxt3"
          + dns_record  = (known after apply)
          + prefix      = "en"
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "nuxt3"
          + dns_record  = (known after apply)
          + prefix      = "fr"
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "nuxt3"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.learning_resources_nuxt3"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.learning_resources_staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.learning_resources_storybook"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main_storybook"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.nuxt3"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.app"]

29 tests, 17 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
